application/app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("price", "created_at", "title", "updated_at", "description", "img_url") VALUES(0.0, '2009-11-04 13:39:28.069891', E'df', '2009-11-04 13:39:28.069891', E'dd', E'fds') RETURNING "id"